
import "./index.css";
const Baan = () => {
  return (
    <div class="chalisa-container">
      
      <h1 class="heading">श्री बजरंग बाण पाठ</h1>
      <div class="chaupai-container">
        <h2 class="h2-heading">॥ दोहा ॥</h2>
        <h3 className="doha">
          निश्चय प्रेम प्रतीति ते, बिनय करैं सनमान ।<br />
          तेहि के कारज सकल शुभ, सिद्ध करैं हनुमान॥
        </h3>
      </div>
      <div class="chaupai-container">
        <h2 class="h2-heading">॥ चौपाई ॥</h2>
        <h4 className="chaupai">
          जय हनुमंत संत हितकारी । सुन लीजै प्रभु अरज हमारी ॥
        </h4>
        <h4 className="chaupai">
          जन के काज बिलंब न कीजै । आतुर दौरि महा सुख दीजै ॥
        </h4>
        <h4 className="chaupai">
          जैसे कूदि सिंधु महिपारा । सुरसा बदन पैठि बिस्तारा ॥
        </h4>
        <h4 className="chaupai">आगे जाय लंकिनी रोका । मारेहु लात गई सुरलोका ॥</h4>
        <h4 className="chaupai">
          जाय बिभीषन को सुख दीन्हा । सीता निरखि परमपद लीन्हा ॥
        </h4>
        <h4 className="chaupai">
          बाग उजारि सिंधु महँ बोरा । अति आतुर जमकातर तोरा ॥
        </h4>
        <h4 className="chaupai">
          अक्षय कुमार मारि संहारा । लूम लपेटि लंक को जारा ॥
        </h4>
        <h4 className="chaupai">
          लाह समान लंक जरि गई । जय जय धुनि सुरपुर नभ भई ॥
        </h4>
        <h4 className="chaupai">
          अब बिलंब केहि कारन स्वामी । कृपा करहु उर अंतरयामी ॥
        </h4>
        <h4 className="chaupai">
          जय जय लखन प्रान के दाता । आतुर ह्वै दुख करहु निपाता ॥
        </h4>
        <h4 className="chaupai">
          जै हनुमान जयति बल-सागर । सुर-समूह-समरथ भट-नागर ॥
        </h4>
        <h4 className="chaupai">
          ॐ हनु हनु हनु हनुमंत हठीले । बैरिहि मारु बज्र की कीले ॥
        </h4>
        <h4 className="chaupai">
          ॐ ह्नीं ह्नीं ह्नीं हनुमंत कपीशा । ॐ हुं हुं हुं हनु अरि उर सीशा ॥
        </h4>
        <h4 className="chaupai">जय अंजनि कुमार बलवंता । शंकरसुवन बीर हनुमंता ॥</h4>
        <h4 className="chaupai">
          बदन कराल काल-कुल-घालक । राम सहाय सदा प्रतिपालक ॥
        </h4>
        <h4 className="chaupai">
          भूत, प्रेत, पिसाच निसाचर । अगिन बेताल काल मारी मर ॥
        </h4>
        <h4 className="chaupai">
          इन्हें मारु, तोहि सपथ राम की । राखु नाथ मरजाद नाम की ॥
        </h4>
        <h4 className="chaupai">
          सत्य होहु हरि सपथ पाइ कै । राम दूत धरु मारु धाइ कै ॥
        </h4>
        <h4 className="chaupai">
          जय जय जय हनुमंत अगाधा । दुख पावत जन केहि अपराधा ॥
        </h4>
        <h4 className="chaupai">
          पूजा जप तप नेम अचारा । नहिं जानत कछु दास तुम्हारा ॥
        </h4>
        <h4 className="chaupai">
          बन उपबन मग गिरि गृह माहीं । तुम्हरे बल हौं डरपत नाहीं ॥
        </h4>
        <h4 className="chaupai">
          जनकसुता हरि दास कहावौ । ताकी सपथ बिलंब न लावौ ॥
        </h4>
        <h4 className="chaupai">
          जै जै जै धुनि होत अकासा । सुमिरत होय दुसह दुख नासा ॥
        </h4>
        <h4 className="chaupai">
          चरन पकरि, कर जोरि मनावौं । यहि औसर अब केहि गोहरावौं ॥
        </h4>
        <h4 className="chaupai">
          उठु, उठु, चलु, तोहि राम दुहाई । पायँ परौं, कर जोरि मनाई ॥
        </h4>
        <h4 className="chaupai">
          ॐ चं चं चं चं चपल चलंता । ॐ हनु हनु हनु हनु हनुमंता ॥
        </h4>
        <h4 className="chaupai">
          ॐ हं हं हाँक देत कपि चंचल । ॐ सं सं सहमि पराने खल-दल ॥
        </h4>
        <h4 className="chaupai">
          अपने जन को तुरत उबारौ । सुमिरत होय आनंद हमारौ ॥
        </h4>
        <h4 className="chaupai">
          यह बजरंग-बाण जेहि मारै । ताहि कहौ फिरि कवन उबारै ॥
        </h4>
        <h4 className="chaupai">
          पाठ करै बजरंग-बाण की । हनुमत रक्षा करै प्रान की ॥
        </h4>
        <h4 className="chaupai">
          यह बजरंग बाण जो जापैं । तासों भूत-प्रेत सब कापैं ॥
        </h4>
        <h4 className="chaupai">
          धूप देय जो जपै हमेसा । ताके तन नहिं रहै कलेसा ॥
        </h4>
      </div>
      <div>
        <h2 className="h2-heading">॥ दोहा ॥</h2>
        <h3 className="doha">
          उर प्रतीति दृढ़, सरन ह्वै, पाठ करै धरि ध्यान ।<br />
          बाधा सब हर, करैं सब काम सफल हनुमान ॥
        </h3>
      </div>
    </div>
  );
};

export default Baan;
