import "./index.css";
const Astak = () => {
  return (
    <div className="chalisa-container">
      <h1 className="heading">हनुमानाष्टक</h1>
      <div>
        <p className="chaupai">
          बाल समय रवि भक्षी लियो तब, तीनहुं लोक भयो अंधियारों ।<br />
          ताहि सों त्रास भयो जग को, यह संकट काहु सों जात न टारो ।<br />
          देवन आनि करी बिनती तब, छाड़ी दियो रवि कष्ट निवारो ।<br />
          को नहीं जानत है जग में कपि, संकटमोचन नाम तिहारो ॥ १ ॥
        </p>
        <p className="chaupai">
          बालि की त्रास कपीस बसैं गिरि, जात महाप्रभु पंथ निहारो ।<br />
          चौंकि महामुनि साप दियो तब, चाहिए कौन बिचार बिचारो ।<br />
          कैद्विज रूप लिवाय महाप्रभु, सो तुम दास के सोक निवारो ॥ २ ॥
        </p>
        <p className="chaupai">
          अंगद के संग लेन गए सिय, खोज कपीस यह बैन उचारो ।<br />
          जीवत ना बचिहौ हम सो जु, बिना सुधि लाये इहाँ पगु धारो ।<br />
          हेरी थके तट सिन्धु सबै तब, लाए सिया-सुधि प्राण उबारो ॥ ३ ॥
        </p>
        <p className="chaupai">
          रावण त्रास दई सिय को सब, राक्षसी सों कही सोक निवारो ।<br />
          ताहि समय हनुमान महाप्रभु, जाए महा रजनीचर मारो ।<br />
          चाहत सीय असोक सों आगि सु, दै प्रभुमुद्रिका सोक निवारो ॥ ४ ॥
        </p>
        <p className="chaupai">
          बान लग्यो उर लछिमन के तब, प्राण तजे सुत रावन मारो ।<br />
          लै गृह बैद्य सुषेन समेत, तबै गिरि द्रोण सु बीर उपारो ।<br />
          आनि सजीवन हाथ दई तब, लछिमन के तुम प्रान उबारो ॥ ५ ॥
        </p>
        <p className="chaupai">
          रावन युद्ध अजान कियो तब, नाग कि फाँस सबै सिर डारो ।<br />
          श्रीरघुनाथ समेत सबै दल, मोह भयो यह संकट भारो ।<br />
          आनि खगेस तबै हनुमान जु, बंधन काटि सुत्रास निवारो ॥ ६ ॥
        </p>
        <p className="chaupai">
          बंधु समेत जबै अहिरावन, लै रघुनाथ पताल सिधारो ।<br />
          देबिहिं पूजि भलि विधि सों बलि, देउ सबै मिलि मन्त्र विचारो ।<br />
          जाय सहाय भयो तब ही, अहिरावन सैन्य समेत संहारो ॥ ७ ॥
        </p>
        <p className="chaupai">
          काज किये बड़ देवन के तुम, बीर महाप्रभु देखि बिचारो ।<br />
          कौन सो संकट मोर गरीब को, जो तुमसे नहिं जात है टारो ।<br />
          बेगि हरो हनुमान महाप्रभु, जो कछु संकट होय हमारो ॥ ८ ॥
        </p>
      </div>
      <div>
        <h2 className="heading">॥ दोहा॥</h2>
        <h3 className="doha">
          लाल देह लाली लसे, अरु धरि लाल लंगूर ।<br />
          वज्र देह दानव दलन, जय जय जय कपि सूर ॥
        </h3>
      </div>
    </div>
  );
};

export default Astak;
