import "./index.css";
const Aarti = () => {
  return (
    <div>
      <div class="chalisa-container">
        <h1 class="heading">॥ श्री हनुमंत स्तुति ॥</h1>

        <div class="chaupai-container">
          <h3 className="doha">
            मनोजवं मारुत तुल्यवेगं, जितेन्द्रियं, बुद्धिमतां वरिष्ठम् ॥<br />
            वातात्मजं वानरयुथ मुख्यं, श्रीरामदुतं शरणम प्रपद्धे ॥
          </h3>
        </div>
        <div class="chaupai-container">
          <h1 class="heading">॥ आरती ॥</h1>

          <div class="chaupai-container">
            <h3 className="doha">
              आरती कीजै हनुमान लला की । दुष्ट दलन रघुनाथ कला की ॥<br />
              <br />
              जाके बल से गिरवर काँपे । रोग-दोष जाके निकट न झाँके ॥<br />
              अंजनि पुत्र महा बलदाई । संतन के प्रभु सदा सहाई ॥ आरती कीजै हनुमान
              लला की ॥<br />
              <br />
              दे वीरा रघुनाथ पठाए । लंका जारि सिया सुधि लाये ॥<br />
              लंका सो कोट समुद्र सी खाई । जात पवनसुत बार न लाई ॥ आरती कीजै
              हनुमान लला की ॥<br />
              <br />
              लंका जारि असुर संहारे । सियाराम जी के काज सँवारे ॥<br />
              लक्ष्मण मुर्छित पड़े सकारे । लाये संजिवन प्राण उबारे ॥ आरती कीजै
              हनुमान लला की ॥<br />
              <br />
              पैठि पताल तोरि जमकारे । अहिरावण की भुजा उखारे ॥<br />
              बाईं भुजा असुर दल मारे । दाहिने भुजा संतजन तारे ॥ आरती कीजै हनुमान
              लला की ॥<br />
              <br />
              सुर-नर-मुनि जन आरती उतरें । जय जय जय हनुमान उचारें ॥<br />
              कंचन थार कपूर लौ छाई । आरती करत अंजना माई ॥ आरती कीजै हनुमान लला
              की ॥<br />
              <br />
              जो हनुमानजी की आरती गावे । बसहिं बैकुंठ परम पद पावे ॥<br />
              लंक विध्वंस किये रघुराई । तुलसीदास स्वामी कीर्ति गाई ॥<br />
              <br />
              आरती कीजै हनुमान लला की । दुष्ट दलन रघुनाथ कला की ॥<br />
              <br />
            </h3>
          </div>
        </div>
        <div>
          <h1 className="end">॥ इति संपूर्णंम् ॥</h1>
        </div>
      </div>
    </div>
  );
};

export default Aarti;
